# Document Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementNode..::..Document Property
ElementNode Class See Also
---
Gets the document associated with the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public Document Document { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Document As Document
	Get
```

Visual C++
---
```text
public:
property Document^ Document {
	Document^ get ();
}
```

# Remarks
The document is in read-only state. Transactions are not allowed in it.
# See Also
ElementNode Class
Autodesk.Revit.DB Namespace